import i18n from "i18next";
import LanguageDetector from "i18next-browser-languagedetector";
import Cookies from "js-cookie";
import { initReactI18next } from "react-i18next";

i18n
    .use(LanguageDetector)
    .use(initReactI18next)
    .init({
        debug: false,
        lng: Cookies.get("language") || "en",
        fallbackLng: ["uk"],
        detection: { order: ["cookie"], cache: ["cookie"] },
        interpolation: {
            escapeValue: false,
        },
        resources: {

            uk: {
                translation: {
                    home: {
                        "title": "Ласкаво просимо на навчальний сайт",
                        "description": "Цей сайт створений для вивчення математичних функцій та їх графіків. Ви знайдете інтерактивні приклади, які допоможуть зрозуміти властивості синуса, косинуса та інших функцій. Досліджуйте математику легко та цікаво!"
                    },
                    eror:{
                        "page": "Сторінка в розробці!!!",
                    },
                    navMenu: {
                        "logo": "EduWebLab",
                        "link1": "Головна",
                        "link2": "Курси",
                        "link3": "Відгуки",
                        "link4": "Математика",
                        "link5": "Фізика",
                        "link6": "Хімія",
                        "langItem1": "English",
                        "langItem2": "Ukrainian",

                    },
                    theme: {
                        "dark" : "Темний режим",
                        "light" : "Світлий режим",
                    },
                    
                    buttons: {
                        "startLearning": "Почати навчання",
                        "startButton": "Почати курс",
                    },

                    "mathPage": {
                        "title": "Графіки математичних функцій",
                        "description": "Оберіть математичну функцію зі списку, щоб побачити її графік на полотні. Ви також можете дізнатися більше про кожну функцію, переглянувши її опис.",
                        "selectFunction": "Оберіть функцію"
                    },
                    "math": {
                        "functions": {
                            "sin": "Синус",
                            "cos": "Косинус",
                            "tan": "Тангенс",
                            "cot": "Котангенс",
                            "sec": "Секанс",
                            "csc": "Косеканс",
                            "quadratic": "Квадратична функція",
                            "cubic": "Кубічна функція",
                            "exp": "Експоненціальна функція",
                            "log": "Логарифмічна функція",
                            "abs": "Модуль числа",
                            "gauss": "Гауссова функція"
                        },
                        "descriptions": {
                            "sin": "Синус — це тригонометрична функція, яка показує співвідношення протилежного катета до гіпотенузи в прямокутному трикутнику. Графік синуса має хвилеподібну форму, яка повторюється кожні 2π радіанів. Синус використовується в фізиці, інженерії та обробці сигналів. Історія синуса бере початок в Індії — вперше був описаний в астрономічному тексті «Сурья-сіддханта» приблизно в V столітті. У Європу функція прийшла через арабських вчених, де отримала назву 'sinus'.",

                            "cos": "Косинус — це тригонометрична функція, яка показує співвідношення прилеглого катета до гіпотенузи. Графік косинуса схожий на графік синуса, але зсунутий на π/2 радіанів. Косинус широко використовується в геометрії та фізиці. Як і синус, косинус має своє коріння в індійській та арабській математиці, але назва 'cosinus' вперше з'явилася у праці Едмунда Гунтера у XVII столітті.",

                            "tan": "Тангенс — це функція, яка визначається як відношення синуса до косинуса. Графік має періодичні асимптоти кожні π радіанів. Тангенс використовується в аналізі нахилів, фізиці та техніці. Вперше поняття тангенса було використане в Європі у працях математиків XVI століття, зокрема Томаса Фінке (1583).",

                            "cot": "Котангенс — це обернена до тангенса тригонометрична функція, що дорівнює відношенню косинуса до синуса. Графік має вертикальні асимптоти кожні π радіанів. Функція застосовується в аналітичній геометрії та тригонометрії. Вперше згадується в європейській математиці у XVII столітті.",

                            "sec": "Секанс — це обернена до косинуса функція: sec(x) = 1/cos(x). Вона відіграє роль у вирішенні складних тригонометричних рівнянь. Секанс вперше згадується в працях англійського математика Едмунда Гунтера у 1620-х роках.",

                            "csc": "Косеканс — це обернена до синуса функція: csc(x) = 1/sin(x). Використовується у тригонометричних тотожностях і обчисленнях. Подібно до секанса, косеканс був введений в математику в епоху Ренесансу в Європі.",

                            "quadratic": "Квадратична функція має вигляд y = ax² + bx + c і є однією з найпростіших поліноміальних функцій. Графік — це парабола. Квадратичні рівняння були відомі ще в Стародавньому Вавилоні (понад 4000 років тому). Повна формалізація та розв’язок квадратного рівняння належить перському вченому Аль-Хорезмі (IX століття).",

                            "cubic": "Кубічна функція має вигляд y = ax³ + bx² + cx + d. Графік має S-подібну форму. Перші методи розв’язку кубічних рівнянь з’явились в Індії в VI столітті, а згодом були розвинені італійськими математиками Нікколо Тарталья та Джироламо Кардано у XVI столітті.",

                            "exp": "Експоненціальна функція y = a^x зростає або спадає дуже швидко залежно від знака x. Вона використовується для моделювання росту населення, фінансів, радіоактивного розпаду. Вперше її почав вивчати Джон Непер у XVII столітті — автор логарифмів.",

                            "log": "Логарифмічна функція є оберненою до експоненціальної. Вона використовується в хімії, біології, акустиці та для моделювання процесів, які уповільнюються. Перші таблиці логарифмів були створені Джоном Непером у 1614 році.",

                            "abs": "Функція модуля або абсолютного значення повертає завжди додатне значення. Графік має V-подібну форму. Хоча ідея абсолютного значення використовувалась у багатьох культурах, термінологічно вона формалізувалась у XVIII–XIX століттях із розвитком аналітичної математики.",

                            "gauss": "Гауссова функція має форму дзвону та використовується в теорії ймовірностей, статистиці та аналізі даних. Вона названа на честь Карла Фрідріха Гаусса, німецького математика, який у XIX столітті описав нормальний розподіл у контексті астрономії."
                        }
                    },
                    "phisics": {
                        "title": "Графіки фізичних законів",
                        "description": "Оберіть фізичний закон зі списку, щоб побачити його графік на полотні. Ви також можете дізнатися більше про кожен закон, переглянувши його опис.",
                        "selectFunction": "Оберіть закон"
                    },
                },
            },
        },
    });

export default i18n;
